In [2]:
import pandas as pd
import numpy as np

In [8]:
dict1={'Student Name':['arham','ali','ahmad','arslan','Usama','majid','abbad','amir','khurram']
       ,'Marks':[88,56,77,56,44,87,57,95,44]}
df=pd.DataFrame(dict1,index=['stu 1','stu 2','stu 3','stu 4','stu 5','stu 6','stu 7','stu 8','stu 9'])
df

      Student Name  Marks
stu 1        arham     88
stu 2          ali     56
stu 3        ahmad     77
stu 4       arslan     56
stu 5        Usama     44
stu 6        majid     87
stu 7        abbad     57
stu 8         amir     95
stu 9      khurram     44

In [10]:
df['Student Name']

stu 1      arham
stu 2        ali
stu 3      ahmad
stu 4     arslan
stu 5      Usama
stu 6      majid
stu 7      abbad
stu 8       amir
stu 9    khurram
Name: Student Name, dtype: object

# Loc method

In [11]:

dict1={'Name':['arham','ali','ahmad','arslan','Usama','majid','abbad','amir','khurram']
       ,'Marks':[88,56,77,56,44,87,57,95,44],
         'Grades':['A','B','C','B','C','D','A','F','A'] }
df=pd.DataFrame(dict1,index=[0,1,2,3,4,5,6,7,8])
df

      Name  Marks Grades
0    arham     88      A
1      ali     56      B
2    ahmad     77      C
3   arslan     56      B
4    Usama     44      C
5    majid     87      D
6    abbad     57      A
7     amir     95      F
8  khurram     44      A

In [12]:
# means 0 index row and all col
df.loc[0,:]

Name      arham
Marks        88
Grades        A
Name: 0, dtype: object

In [13]:
df.loc[[0,1,2],:]

    Name  Marks Grades
0  arham     88      A
1    ali     56      B
2  ahmad     77      C

In [14]:
df.loc[0:2.:]

    Name  Marks Grades
0  arham     88      A
1    ali     56      B
2  ahmad     77      C

In [15]:
df.loc[:,'Name']

0      arham
1        ali
2      ahmad
3     arslan
4      Usama
5      majid
6      abbad
7       amir
8    khurram
Name: Name, dtype: object

In [16]:
df.loc[:,['Name','Marks']]

      Name  Marks
0    arham     88
1      ali     56
2    ahmad     77
3   arslan     56
4    Usama     44
5    majid     87
6    abbad     57
7     amir     95
8  khurram     44

In [18]:
# all rows and from name to all col    
df.loc[:,'Name':]

      Name  Marks Grades
0    arham     88      A
1      ali     56      B
2    ahmad     77      C
3   arslan     56      B
4    Usama     44      C
5    majid     87      D
6    abbad     57      A
7     amir     95      F
8  khurram     44      A

In [21]:
df.loc[[True,True,False,False,False,False,False,False,False,]]

    Name  Marks Grades
0  arham     88      A
1    ali     56      B

# iLoc Method

In [19]:
df.iloc[:,0]
# it means the all rows and the 0 means name all the rows of name col

0      arham
1        ali
2      ahmad
3     arslan
4      Usama
5      majid
6      abbad
7       amir
8    khurram
Name: Name, dtype: object

In [20]:
df.iloc[:,0:2]

      Name  Marks
0    arham     88
1      ali     56
2    ahmad     77
3   arslan     56
4    Usama     44
5    majid     87
6    abbad     57
7     amir     95
8  khurram     44